tasiekzpl/ROBOTICS-PROJECTS/stm32_program.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "vl53l0x_api.h"
#include "stm32f4xx.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */





/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim11;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM11_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


//VL53L0X_RangingMeasurementData_t RangingData;
//VL53L0X_Dev_t  devCenter; // left module
//VL53L0X_Dev_t  devLeft; // center module
//VL53L0X_Dev_t  devRight; // right module


VL53L0X_RangingMeasurementData_t RangingData;
VL53L0X_RangingMeasurementData_t RangingData2;

VL53L0X_Dev_t  vl53l0x_p; // prawy
VL53L0X_Dev_t  vl53l0x_c; // center module
VL53L0X_Dev_t  vl53l0x_l; // lewy

VL53L0X_DEV    Dev = &vl53l0x_p;

int flaga_startu=0;
int flaga_startu2=0;
int status;

uint8_t Message[64];
uint8_t MessageLen;

uint16_t ticksy=0;

volatile static uint16_t value[2];// pomiar adc tablica 2 elementowa
volatile static uint16_t value_calib[2];// progi dla czujnikow krawedziowych

void fun_namierz(void){

	HAL_TIM_Base_Start_IT(&htim11);


}



// Override the weak call back function
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

      if (htim->Instance == TIM11)
      {


    	  if (flaga_startu)
		  {

    	  		MessageLen = sprintf((char*)Message, "tiksy przed, i jazda: %i\n\r",ticksy);
    	  	  	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);


    	  	  	if(!(value[1]<=value_calib[0]))
    	  	  	{
    	  	  		//jazda w prawo
					HAL_GPIO_WritePin(motor_2B_GPIO_Port, motor_2B_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(motor_1B_GPIO_Port, motor_1B_Pin, GPIO_PIN_RESET);

    	  	  	}else
    	  	  	{
    	  			HAL_GPIO_WritePin(motor_2B_GPIO_Port, motor_2B_Pin, GPIO_PIN_SET);
    	  			HAL_GPIO_WritePin(motor_1B_GPIO_Port, motor_1B_Pin, GPIO_PIN_SET);

    	  	  	}


    	  		if(ticksy>=65)
    	  		{
    	  			//STOP
    	  			MessageLen = sprintf((char*)Message, "zatrzymanie %i\n\r",ticksy);
    	  	  		HAL_UART_Transmit(&huart1, Message, MessageLen, 100);


    	  			HAL_GPIO_WritePin(motor_2B_GPIO_Port, motor_2B_Pin, GPIO_PIN_SET);
    	  			HAL_GPIO_WritePin(motor_1B_GPIO_Port, motor_1B_Pin, GPIO_PIN_SET);

    	  			ticksy=0; // wyzeruj ticksy
    	  			flaga_startu=0;
    	  		}

    	  		ticksy=ticksy+1;
    	  }
////////////////////////////////////////////////////////////////////////////////////////////////////
    	  if (flaga_startu2)
		  {

    		  if(!(value[0]<=value_calib[0]))
    			  {
    			  //JAZDA w lewo (patrzac od kierowcy
    			  HAL_GPIO_WritePin(motor_1A_GPIO_Port, motor_1A_Pin, GPIO_PIN_SET);
    			  HAL_GPIO_WritePin(motor_2A_GPIO_Port, motor_2A_Pin, GPIO_PIN_RESET);
    			  }else{
      				HAL_GPIO_WritePin(motor_1A_GPIO_Port, motor_1A_Pin, GPIO_PIN_SET);
      				HAL_GPIO_WritePin(motor_2A_GPIO_Port, motor_2A_Pin, GPIO_PIN_SET);
    			  }




    	  		if(ticksy>=65)
    	  		{
    	  			//STOP
    	  			MessageLen = sprintf((char*)Message, "zatrzymanie %i\n\r",ticksy);
    	  	  		HAL_UART_Transmit(&huart1, Message, MessageLen, 100);


    				HAL_GPIO_WritePin(motor_1A_GPIO_Port, motor_1A_Pin, GPIO_PIN_SET);
    				HAL_GPIO_WritePin(motor_2A_GPIO_Port, motor_2A_Pin, GPIO_PIN_SET);

    	  			ticksy=0; // wyzeruj ticksy
    	  			flaga_startu2=0;
    	  		}

    	  		ticksy=ticksy+1;
    	  }




      }

}




/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
//------------------------------------------------------------

//------------------------------------------------------------------------------
	// VL53L0X initialisation stuff
	//
    uint32_t refSpadCount;
    uint8_t isApertureSpads;
    uint8_t VhvSettings;
    uint8_t PhaseCal;


    volatile static uint16_t sensor_left_dist;
    volatile static uint16_t sensor_center_dist;
    volatile static uint16_t sensor_right_dist;

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */





  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
  MX_ADC1_Init();
  MX_TIM11_Init();
  /* USER CODE BEGIN 2 */



  //--------------------------------ustawienia ADC------------------------
  //HAL_ADCEx_Calibration_Start(&hadc1);
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)value, 2); // pomiar adc z nieznanym mi czasem :)
  // ------------------------------koniec ustawien adc-------------------------



//-----------------------------------------------pierwszy czujnik prawy zmiana adresu----------------------------------------------------------------------


   HAL_GPIO_WritePin(x_prawy_GPIO_Port,x_prawy_Pin, GPIO_PIN_SET); // Enable XSHUT
   HAL_GPIO_WritePin(x_srodek_GPIO_Port,x_srodek_Pin , GPIO_PIN_RESET); // Enable XSHUT
   HAL_GPIO_WritePin(x_lewy_GPIO_Port, x_lewy_Pin, GPIO_PIN_RESET); // Enable XSHUT

