tasiekzpl/ROBOTICS-PROJECTS/stm32_program.c
   HAL_Delay(100);

// blokA
  MessageLen = sprintf((char*)Message, "inicjalizacja VL53L0X PRAWY\n\r");
    HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

    Dev->I2cHandle = &hi2c1;
    Dev->I2cDevAddr = 0x52;

    VL53L0X_SetDeviceAddress(Dev, 0x30);
    HAL_Delay(100);

    Dev->I2cDevAddr = 0x30;
    // VL53L0X init for Single Measurement
    //

    VL53L0X_WaitDeviceBooted( Dev );
    VL53L0X_DataInit( Dev );
    VL53L0X_StaticInit( Dev );
    VL53L0X_PerformRefCalibration(Dev, &VhvSettings, &PhaseCal);
    VL53L0X_PerformRefSpadManagement(Dev, &refSpadCount, &isApertureSpads);
    VL53L0X_SetDeviceMode(Dev, VL53L0X_DEVICEMODE_SINGLE_RANGING);

    // Enable/Disable Sigma and Signal check
    VL53L0X_SetLimitCheckEnable(Dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, 1);
    VL53L0X_SetLimitCheckEnable(Dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, 1);
    VL53L0X_SetLimitCheckValue(Dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, (FixPoint1616_t)(0.1*65536));
    VL53L0X_SetLimitCheckValue(Dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, (FixPoint1616_t)(60*65536));
    VL53L0X_SetMeasurementTimingBudgetMicroSeconds(Dev, 33000);
    VL53L0X_SetVcselPulsePeriod(Dev, VL53L0X_VCSEL_PERIOD_PRE_RANGE, 18);
    VL53L0X_SetVcselPulsePeriod(Dev, VL53L0X_VCSEL_PERIOD_FINAL_RANGE, 14);
    //


  //-------------------------------------------------------drugi CZUJNIK center zmiana adresu-------------------------------------------------------------------------


    Dev = &vl53l0x_c;

    HAL_GPIO_WritePin(x_prawy_GPIO_Port,x_prawy_Pin, GPIO_PIN_SET); // Enable XSHUT
    HAL_GPIO_WritePin(x_srodek_GPIO_Port,x_srodek_Pin , GPIO_PIN_SET); // Enable XSHUT
    HAL_GPIO_WritePin(x_lewy_GPIO_Port, x_lewy_Pin, GPIO_PIN_RESET); // Enable XSHUT
    //HAL_Delay(1000);
 // blokA
   MessageLen = sprintf((char*)Message, "inicjalizacja VL53L0X center\n\r");
     HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

     Dev->I2cHandle = &hi2c1;
     Dev->I2cDevAddr = 0x52;

     VL53L0X_SetDeviceAddress(Dev, 0x32);
     HAL_Delay(100);

     Dev->I2cDevAddr = 0x32;
     // VL53L0X init for Single Measurement
     //
     HAL_Delay(1000);

     VL53L0X_WaitDeviceBooted( Dev );
     VL53L0X_DataInit( Dev );
     VL53L0X_StaticInit( Dev );
     VL53L0X_PerformRefCalibration(Dev, &VhvSettings, &PhaseCal);
     VL53L0X_PerformRefSpadManagement(Dev, &refSpadCount, &isApertureSpads);
     VL53L0X_SetDeviceMode(Dev, VL53L0X_DEVICEMODE_SINGLE_RANGING);
     //VL53L0X_SetDeviceMode(Dev, VL53L0X_DEVICEMODE_CONTINUOUS_RANGING);

     // Enable/Disable Sigma and Signal check
     VL53L0X_SetLimitCheckEnable(Dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, 1);
     VL53L0X_SetLimitCheckEnable(Dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, 1);
     VL53L0X_SetLimitCheckValue(Dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, (FixPoint1616_t)(0.1*65536));
     VL53L0X_SetLimitCheckValue(Dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, (FixPoint1616_t)(60*65536));
     VL53L0X_SetMeasurementTimingBudgetMicroSeconds(Dev, 33000);
     VL53L0X_SetVcselPulsePeriod(Dev, VL53L0X_VCSEL_PERIOD_PRE_RANGE, 18);
     VL53L0X_SetVcselPulsePeriod(Dev, VL53L0X_VCSEL_PERIOD_FINAL_RANGE, 14);
     //

     //-------------------------------------------------------trzeci CZUJNIK lewy bezzmiany-------------------------------------------------------------------------


       Dev = &vl53l0x_l;

       HAL_GPIO_WritePin(x_prawy_GPIO_Port,x_prawy_Pin, GPIO_PIN_SET); // Enable XSHUT
       HAL_GPIO_WritePin(x_srodek_GPIO_Port,x_srodek_Pin , GPIO_PIN_SET); // Enable XSHUT
       HAL_GPIO_WritePin(x_lewy_GPIO_Port, x_lewy_Pin, GPIO_PIN_SET); // Enable XSHUT

       HAL_Delay(100);
    // blokA
      MessageLen = sprintf((char*)Message, "msalamon.pl VL53L0X drugi\n\r");
        HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

        Dev->I2cHandle = &hi2c1;
        Dev->I2cDevAddr = 0x52;

       // VL53L0X_SetDeviceAddress(Dev, 0x54);

        // VL53L0X init for Single Measurement
        //
        HAL_Delay(100);

        VL53L0X_WaitDeviceBooted( Dev );
        VL53L0X_DataInit( Dev );
        VL53L0X_StaticInit( Dev );
        VL53L0X_PerformRefCalibration(Dev, &VhvSettings, &PhaseCal);
        VL53L0X_PerformRefSpadManagement(Dev, &refSpadCount, &isApertureSpads);
        VL53L0X_SetDeviceMode(Dev, VL53L0X_DEVICEMODE_SINGLE_RANGING);
        //VL53L0X_SetDeviceMode(Dev, VL53L0X_DEVICEMODE_CONTINUOUS_RANGING);

        // Enable/Disable Sigma and Signal check
        VL53L0X_SetLimitCheckEnable(Dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, 1);
        VL53L0X_SetLimitCheckEnable(Dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, 1);
        VL53L0X_SetLimitCheckValue(Dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, (FixPoint1616_t)(0.1*65536));
        VL53L0X_SetLimitCheckValue(Dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, (FixPoint1616_t)(60*65536));
        VL53L0X_SetMeasurementTimingBudgetMicroSeconds(Dev, 33000);
        VL53L0X_SetVcselPulsePeriod(Dev, VL53L0X_VCSEL_PERIOD_PRE_RANGE, 18);
        VL53L0X_SetVcselPulsePeriod(Dev, VL53L0X_VCSEL_PERIOD_FINAL_RANGE, 14);
        //





  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

    //INICJALIZACJA CZUJNIKOW-----------pomiar na nacznym i ustawienie progu na 1/3

  	  // pomiar czujników krancowych pierwszy raz
  	 	MessageLen = sprintf((char*)Message, "calib 1=%u, calib 2=%u\n",value[0], value[1]);
  		HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

  		value_calib[0]=value[0]/2; // tu wprowadzic zmienna
  		value_calib[1]=value[1]/2; //// tu wprowadzic zmienna

  	 	MessageLen = sprintf((char*)Message, "calib prog 1=%u, calib prog 2=%u\n",value_calib[0], value_calib[1]);
  		HAL_UART_Transmit(&huart1, Message, MessageLen, 100);


  while (1)
  {
//pierwszy--------------------------------------
	 HAL_Delay(20);
	 Dev = &vl53l0x_p;
	 VL53L0X_StartMeasurement(Dev);
	  VL53L0X_PerformSingleRangingMeasurement(Dev, &RangingData);
	  	  if(RangingData.RangeStatus == 0)
	  	  {
	  		sensor_right_dist=RangingData.RangeMilliMeter;
	  	//	  MessageLen = sprintf((char*)Message, "prawy: %i\n\r", RangingData.RangeMilliMeter);
	  	//	  HAL_UART_Transmit(&huart1, Message, MessageLen, 100);
	  	  }
	  	VL53L0X_StopMeasurement(Dev);

//----------------------------drugi--------------------------------------

