tasiekzpl/ROBOTICS-PROJECTS/stm32_program.c
	  HAL_Delay(20);
	  Dev = &vl53l0x_c;
	  VL53L0X_StartMeasurement(Dev);
	  HAL_Delay(2);
	  VL53L0X_PerformSingleRangingMeasurement(Dev, &RangingData);

	  	  if(RangingData2.RangeStatus == 0)
		  	  {
	  		  sensor_center_dist=RangingData.RangeMilliMeter;
		  	//	MessageLen = sprintf((char*)Message, "srodek: %i\n\r", RangingData2.RangeMilliMeter);
		  	//	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);
		  	  }
		  VL53L0X_StopMeasurement(Dev);


//----------------------------trzeci--------------------------------------

	HAL_Delay(20);
	Dev = &vl53l0x_l;
	VL53L0X_StartMeasurement(Dev);
	HAL_Delay(2);
		VL53L0X_PerformSingleRangingMeasurement(Dev, &RangingData);

		 if(RangingData2.RangeStatus == 0)
		    {
			 sensor_left_dist=RangingData.RangeMilliMeter;


			 //if(RangingData2.RangeMilliMeter>=385)
			// 	 MessageLen = sprintf((char*)Message, "za daleko lewy: %i\n\r", RangingData2.RangeMilliMeter);
		  	//	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

		  	 }
	  VL53L0X_StopMeasurement(Dev);


	  // pomiar czujników KRANCOWYCH
	 //	 MessageLen = sprintf((char*)Message, "value1=%u, value2=%u\n",value[0], value[1]);
	//	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);


/* wysylanie pomiarow uartem
		MessageLen = sprintf((char*)Message, "LEWY: %i\n\r",sensor_left_dist);
	  	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

		MessageLen = sprintf((char*)Message, "SRODEK: %i\n\r",sensor_center_dist);
	  	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);

		MessageLen = sprintf((char*)Message, "PRAWY: %i\n\r",sensor_right_dist);
	  	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);
	  	*/

//----------------------------------------------test timera i czujniika--------------------------------------






  		//HAL_TIM_Base_Start(&htim11);
	 HAL_TIM_Base_Start_IT(&htim11);

	  	//if(TIM11->CNT>=999){
		//	MessageLen = sprintf((char*)Message, "timer pelny licznik 11: %i\n\r",TIM11->CNT);
		  //	HAL_UART_Transmit(&huart1, Message, MessageLen, 100);
	  //	}


	  	if(sensor_right_dist<=200)
	  	{

	  		//HAL_TIM_Base_Start_IT(&htim11);
	  		flaga_startu=1;
	  		//fun_namierz();


		}
	  	if(sensor_left_dist<=200)
	  	{
	  		flaga_startu2=1;
	  	}







//-----------------------------------------zalaczanie silniczkow-------------------------------------------
/* komentarz start
		if(value[0]<=value_calib[0])
		{

			// wychamowanie
			HAL_GPIO_WritePin(motor_1A_GPIO_Port, motor_1A_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(motor_2A_GPIO_Port, motor_2A_Pin, GPIO_PIN_SET);

			//STOP
			HAL_GPIO_WritePin(motor_1A_GPIO_Port, motor_1A_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(motor_2A_GPIO_Port, motor_2A_Pin, GPIO_PIN_SET);

		}else
		{
			// JAZDA
			HAL_GPIO_WritePin(motor_1A_GPIO_Port, motor_1A_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(motor_2A_GPIO_Port, motor_2A_Pin, GPIO_PIN_RESET);
		}

		if(value[1]<=value_calib[1])
		{

			//wychamowanie
			HAL_GPIO_WritePin(motor_2B_GPIO_Port, motor_2B_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(motor_1B_GPIO_Port, motor_1B_Pin, GPIO_PIN_SET);

			//STOP
			HAL_GPIO_WritePin(motor_1B_GPIO_Port, motor_1B_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(motor_2B_GPIO_Port, motor_2B_Pin, GPIO_PIN_SET);

		}else
		{
			//JAZDA w lewo (patrzac od kierowcy
			HAL_GPIO_WritePin(motor_2B_GPIO_Port, motor_2B_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(motor_1B_GPIO_Port, motor_1B_Pin, GPIO_PIN_RESET);


		}
komentarz end
*/





    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = ENABLE;
  hadc1.Init.ContinuousConvMode = ENABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 2;
  hadc1.Init.DMAContinuousRequests = ENABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_1;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_480CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_0;
  sConfig.Rank = 2;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

